[
  {
    "name": "vyasashram_baithkji",
    "url": "https://www.nathdwara.in/bethakji/79.gif",
    "gupt": false,
    "caption": " When Shri Mahaprabhu Vallabhacharya visited Veda Vyasa, the Lord’s literary incarnation in his cave high in the Himilayas, he told Krishnadas Meghan to stand outside the cave until he returned. After meeting Veda Vyasa, Shri Mahaprabhuji explained one line from Veda Vyasa, Bhramar Gita found in the Bhagavat for three days and nights. Veda vyasa praised Shri Mahaprabhuji, “Your extraordinary commentary has poured nectar into my heart.” Taking his leave, when Shri Mahaprabhuji returned out of the cave and found Krishnadas standing in the same position he left him three days earlier and asked him why he was still standing there. Krishnadas explained that he was just following the guru’s orders. Shri Mahaprabhu please with him granted him a boon and the disciple asked to have all of his sins of the tongue removed, to have the teachings of the path of Grace established firmaly in his heart, and for Shri Mahaprabhu Vallabhacharya to accept his former guru. Shri Mahaprabhuji granted the first two but not the last. {see Krishnada’s Meghan story in the 84 Vaishnavas} Shri Mahaprabhuji then brought of consciousness all of his disciples who presumed that their guru had permanently left them. After performing a saptah he proceeded to Himachal. "
  },
  {
    "name": "adel",
    "url": "https://www.nathdwara.in/bethakji/79.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "kedarnath_baithkji",
    "url": "https://www.nathdwara.in/bethakji/78.gif",
    "gupt": true,
    "caption": "By the kedarnath lake in the Himilayas Shri Mahaprabhu Vallabhacharya made his seat and began the “saptah.” Lord Kedarnath disguised as a yogi would daily come to listen and finally Krishnadas Meghan questioned the guru who he was. Shri Mahaprabhuji smiled and revealed his identity. After the discourese was over, a divine aroma emerged from Shri Mahaprabhu Vallabhacharya’s feet and thousands of beings who merely smelled it became liberated. From here Shri Mahaprabhuji proceeded to Vyasashram. "
  },
  {
    "name": "tagadi_baithkji",
    "url": "https://www.nathdwara.in/bethakji/68.gif",
    "gupt": false,
    "caption": " Here Shri Mahaprabhu Vallabhacharya made his seat under a tree in front of a Brahmin’s house. The Barahmin had ten cows and ten buffaloes from whose milk he daily made butter. One day, after churning the butter, his wife went to the well to bring some water. Meanwhile, the Brahmin was his two sons eating the freshly churned butter. He immediately called Shri Mahaprabhuji to witness the divine thieving. The guru said, “In you heart lives divine love for Lord Krishna’s lila. Go show you wife their play.”  The Brahmin then embraced his sons and said, “You have played as the Immortal Lord has sported. “He then described the entire incident to his wife and told her a great saint had blessed their house and through his grace they could become true devotees of the Lord. His wife’s attitude change and divine love poured in her heart for her sons. Returning home, both bowed to Shri Mahaprabhu Vallabhacharya and his wife went and hugged her sons and elated, “I am so glad that you have eaten the butter.” "
  },
  {
    "name": "totadriparvat_baithkji",
    "url": "https://www.nathdwara.in/bethakji/51.gif",
    "gupt": true,
    "caption": " Here in the middle of a wild jungle Shri Mahaprabhu Vallabhacharya made camp. When Krishnadas Meghan mentioned that there was no water nearby, the guru explained that “Near to that Kadam tree on its south side is a large rock. Under it is a large lake filled with fresh water. After the lake was discovered it was named Vallabh lake.  The Mayavadians there coming to know of Shri Mahaprabhuji’s arrival sent to people to investigate the situation. When they asked Shri Mahaprabhuji where he expected to find water in such a dry place, Krishnadas showed them the newly discovered lake. Later, the rest of the Mayavadians arrived there and seeing the lake thought, “We have lived here a long time and never knew about this lake. Shri Mahaprabhu Vallabhacharya must be a spark of the original Godhead.” "
  },
  {
    "name": "bharuch_baithkji",
    "url": "https://www.nathdwara.in/bethakji/54.gif",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed by the banks of the holy Narmada river. There, a young women adorned from head to toe with celestial jewels came and bowed at Mahaprabhuji’s feet and said, “I know the reason ;for your appearance is solely for the upliftment of divine souls. You wander about sanctifying holy places and rivers by your mere logch please bless this Narmada river by bathing in her waters.” "
  },
  {
    "name": "naroda_baithkji",
    "url": "https://www.nathdwara.in/images/bg_cow.gif",
    "gupt": false,
    "caption": "At Naroda, Shri Mahaprabhu Vallabhacharya stayed at the home of Gopaldas. The guru gave Gopaldas knowledge of Shri Krishna and initiated him into hte path of Grace and gave him a Krishna Deity to serve. His wishes fulfilled, he remained in transcendental bliss always singing the glories of his guru and Shri Krishna. After speaking on the Shrimad Bhagavata Shri Mahaprabhu Vallabhachayra proceeded to Godhra. "
  },
  {
    "name": "trilokbhanji_baithkji",
    "url": "https://www.nathdwara.in/bethakji/50.gif",
    "gupt": true,
    "caption": "Here, Shri Mahaprabhu Vallabhacharya halted in a lovely spot. Many Mayavadians lived there who worshipped a goddess. When they heard about Shri Mahaprabhuji’s arrival, they came there to debate with him. Within a short while, Shri Mahaprabhuji revealed to them the true meaning of the scriptures and the path of Grace and they became his disciples. Later, Lord Trilokbhanji appeared to Shri Mahaprabhuji and the guru offered Him some fruits and made the Lord’s ornamentation. Shri Mahaprabhuji stayed there for a few days before proceeding to Totadri Mountain. "
  },
  {
    "name": "gangasagar_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/31.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "champaranya_pragatya_baithakji",
    "url": "https://www.nathdwara.in/bethakji/32.gif",
    "gupt": false,
    "caption": " For the Lord’s graceful glance came the divine souls and from his glance of maya came te demonical souls. Shri Mahaprabhuji appeard to uplift divine souls. That is the reason for his appearance. Shri Vitthalnathji said that if Shri Mahaprabhuji did not appear, “The creation of the divine souls would pass wasted.” He also revealed that, “Fro th eupliftment of divine souls, Shri Mahaprabhu Vallabhacharya appeard upon the earth.”  In the south of India, in the town of Kankarvad appeared Shri Vallabhacharya’s forefather Narayanbhatt who was an incarnation of the Vedas and knew th esacred texts by heart. He started to perform the sacred soma. Sacrifice and complete 32 such rites in the course of his lifetime. When they were completed a celestial voice came from the sacrificial pit fire and said, “Narayana Bhatt, you are blessed; the primal Godhead has accepted your offerings. Within your family the Lord will take birth and from the sacrificial fires my Deity will appear.” "
  },
  {
    "name": "darbasenji_baithkji",
    "url": "https://www.nathdwara.in/bethakji/52.gif",
    "gupt": true,
    "caption": " Here in the midst of a dangerous jungle Shri Mahprabhu Vallabhacharya made camp. Lord Varadasen arrived there and advised, “You have picked a dangerous place to stay.” And then added, “Your descendants will shower grace on divine souls in the future. I would like to have their sights, but that might trouble you.\" "
  },
  {
    "name": "kamvan_baithkji",
    "url": "https://www.nathdwara.in/bethakji/52.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "mathuraji_baithakji",
    "url": "https://www.nathdwara.in/bethakji/05.gif",
    "gupt": false,
    "caption": " Once, a disciple of Shri Krishna Chaitanya, Gopaldas, prayed to Shri Krishna Chaitanya to give him a Deity to worship. Shri Chaitanya in turn entrusted to him a shaligram. Gopaldas worshipped the shligram but was distressed at heart because he desired a Deity which he could decorate with clothes and jewels, and on a shligram this can not be done. He later approached hiis guru in hopes of securing such a Deity. Shri Krishna Chaitanya, however, remained silent. After Shri Chaitanaya and proceeded to Jagannathpuri, Gopaldas had a dream in which Shri Krishna Chaitanaya told him, “I have appeared to establish the greatness of chanting the Lord’s najes. Only Shri Vallabhacharya Mahaprabhu has the right to give the service of the Lord’s svarupa. By His grace your wish will become fulfilled.” "
  },
  {
    "name": "janakpur_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/30.gif",
    "gupt": true,
    "caption": ""
  },
  {
    "name": "girirajji_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/15.gif",
    "gupt": true,
    "caption": ""
  },
  {
    "name": "mandrachal_baithkji",
    "url": "https://www.nathdwara.in/bethakji/82.gif",
    "gupt": true,
    "caption": ""
  },
  {
    "name": "godhara_baithkji",
    "url": "https://www.nathdwara.in/bethakji/70.gif",
    "gupt": false,
    "caption": " At godhra, Shri Mahaprabhu Vallabhacharya stayed at the home of Ranavyasa. Before he took initiation, he was a great scholar of vedic literature and was very proud of his extensive learning. Once, when he was defeated in Benares, he became so depressed that he decided to drown himself in the Ganges river. At that time, Shri Mahaprabhuji was performing his prayers on the nearby banks and Krishnadas Meghan asked the guru what was the fruit received from drowning oneself in the Ganges river. Shri Mahaprabhuj explained, “That soul would undergo at least seven hellish lives and would gain no fruits here or elsewhere.” "
  },
  {
    "name": "surat_baithkji",
    "url": "https://www.nathdwara.in/bethakji/53.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "gheravan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/17.gif",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed by a lake and held a ‘Bhagavata saptah’. One day he went on a walk to see the Gahavarvan forest and saw a dead boa constrictor with many ants biting it saying, “why did you ruin our lives|”  After bathing in piri and Prem lake Shri Mahaprabhu Vallabhacharya and his disciples proceeded towards Sanket. "
  },
  {
    "name": "vrindavan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/04.gif",
    "gupt": false,
    "caption": " Once, a disciple of Shri Krishna Chaitanya, Gopaldas, prayed to Shri Krishna Chaitanya to give him a Deity to worship. Shri Chaitanya in turn entrusted to him a shaligram. Gopaldas worshipped the shligram but was distressed at heart because he desired a Deity which he could decorate with clothes and jewels, and on a shligram this can not be done. He later approached hiis guru in hopes of securing such a Deity. Shri Krishna Chaitanya, however, remained silent. After Shri Chaitanaya and proceeded to Jagannathpuri, Gopaldas had a dream in which Shri Krishna Chaitanaya told him, “I have appeared to establish the greatness of chanting the Lord’s najes. Only Shri Vallabhacharya Mahaprabhu has the right to give the service of the Lord’s svarupa. By His grace your wish will become fulfilled.” "
  },
  {
    "name": "jagannath_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/34.gif",
    "gupt": false,
    "caption": " Madhaananda, a celibate, performed austerities on the banks of the Ganges river. After 28 years, the river blessed him with a boon and he requested to have the sight of Krishna’s divine realm, The river replied that his wish would be fulfilled at the Champaranaya forest where the Lord was going to take birth. Meanwhile another renuncated, Mukundads lived in puskar Rajasthan where he daily read the entire Shrimad Bhagavatam. He was also blessed with a boon and he too requested to have the sight of Krishna’s Braja lila and was advised to proceeded to the Champaranaya forest. They both reached just after Shri Mahaprabhu Vallabhacharya was born and told Lakshman Bhatt the purpose of their visit. When they saw the divine child they receive the sacred sight of the divine abode and they both left their material bodies and entered into the eternal lila. "
  },
  {
    "name": "champranya_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/32.gif",
    "gupt": false,
    "caption": " Madhaananda, a celibate, performed austerities on the banks of the Ganges river. After 28 years, the river blessed him with a boon and he requested to have the sight of Krishna’s divine realm, The river replied that his wish would be fulfilled at the Champaranaya forest where the Lord was going to take birth. Meanwhile another renuncated, Mukundads lived in puskar Rajasthan where he daily read the entire Shrimad Bhagavatam. He was also blessed with a boon and he too requested to have the sight of Krishna’s Braja lila and was advised to proceeded to the Champaranaya forest. They both reached just after Shri Mahaprabhu Vallabhacharya was born and told Lakshman Bhatt the purpose of their visit. When they saw the divine child they receive the sacred sight of the divine abode and they both left their material bodies and entered into the eternal lila. "
  },
  {
    "name": "janardankshetra_baithakji",
    "url": "https://www.nathdwara.in/bethakji/48.gif",
    "gupt": false,
    "caption": " By a beautiful lake, Shri Mahaprabhu Vallabhacharya halted. On the following day, joined by his disciples, they went to have the sight of Lord Janardan in the temple. After Shri Mahaprabhuji made the Lord’s ornamentation Lord Janardan said, “Today I have had the opportunity to experience the touch of your sacred hands.” "
  },
  {
    "name": "himachalparvat_baithkji",
    "url": "https://www.nathdwara.in/bethakji/80.gif",
    "gupt": true,
    "caption": " On top of the Himachal mountain, Shri Mahaprabhu Vallabhacharya made his seat. There, Krishnadas Meghan requested the guru to make a saptah. The Himachal mountain dressed as a Brahmin appeared there and Shri Mahaprabhuji took him that he would remain blissful by listening to the Shrimad Dhagavalam. By the completion of the sacred work many souls were enlightened. "
  },
  {
    "name": "vyasganga_baithkji",
    "url": "https://www.nathdwara.in/bethakji/81.gif",
    "gupt": true,
    "caption": ""
  },
  {
    "name": "kheralu_baithkji",
    "url": "https://www.nathdwara.in/bethakji/71.gif",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed at the home of Jagannath Josi upon who the guru was very pleased. After Shri Mahaprabhuji prepared the meals and made the offering he partook of the prasada before Jagannath requested him the explain to him the Gopi’s “Yugal Gita” song which appears in the 10 canto of the Shrimad Bhagavatam. For nine hours Shri Mahaprabhuji spoke and immersed all present there in complete transcendental bliss. Form there, he proceeded to siddhapur. "
  },
  {
    "name": "avantikapuri_baithkji",
    "url": "https://www.nathdwara.in/bethakji/73.gif",
    "gupt": false,
    "caption": " At Avantika Puri, Shri Mahaprabhu Vallabhacharya made his seat by the banks of the Gomati lake under a pipal Tree. After bathing in ;the chipra river, he said to Damala, “This place is sacred to Lord Shiva. To uplift the divine souls here, I should speak the Shirmad Bhagavatam. The only problem I foresee is that there is no shady place to hold the discourse. Damala replied, “If you want, you can make a forest so to find one tree should not be very difficult.”  Early the next morning, after Shri Mahaprabhuji had taken his bath he noticed a huge shady pipal tree in the place where he had sprinkled the water the previous day. Taking his seat under the tree he began the “saptah”. The local prople who came to bath in the Gomati lake were very surprised to see the huge tree which had grown ;to be several hundred years old in the course of a single night. The Mayavadians who lived there heard of Shri Mahaprabhu Vallabhacharya’s arrival but were afraid to even stir out.  Lord Shiva had two great devotees there. One day, after Shiva had gone to hear Shri Mahaprabhuji he told two of his close followers, “It was the Lord’s wish for me to incarnate as Shankaracharya in order to establish the theory of the Mayavada, but now it is the Supreme Lord’s wish to show the supremacy of devotion. The Lord has incarnated as Shri Mahaprabhu Vallabhacharya and tomorrow I will go hear him. Accompany me if you wish.”  After the reading of the Shrimad Bhagavatam was completed, Shri Mahaprabhuj request Shiva to call all the Mayavadians for a religious debate and that night Shiva appeared in all the Mayavadians dreams and told them to fearlessly face Shri Mahaprabhu Vallabhacharya. The following day, they all came and Shiva secretly took his seat to watch the debate. Shri Mahaprabhuj proved to everyone there that Brahmavada was the essence of Vedic thought and the Mayavadians received initiation from Shri Mahaprabhuji. Seeing this pastime, Lord Shiva privately apporoached Shri Mahaprabhu Vallabhacharya and said, “I thought that you would defeat them through scriptural debate, but you were victorious over the Mayavadians through your own divinity.” "
  },
  {
    "name": "jamkhambaliya_baithkji",
    "url": "https://www.nathdwara.in/bethakji/57.gif",
    "gupt": false,
    "caption": " By the banks of a laovely pond, Shri Mahaprabhu Vallabhacharya spoke the Bhagavatam. One afternoon a Brahmin arrived there and said, “you should not spend the night here because a man-eating ghost wanders about at night.” Despite his warning, the guru did not move the camp. "
  },
  {
    "name": "navanagar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/56.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "morbi_baithkji",
    "url": "https://www.nathdwara.in/bethakji/55.gif",
    "gupt": false,
    "caption": "Here Shri Mahaprabhu Vallabhacharya halted by the edge of the Krishna lake where he mentioned to Krishnadas, “This town was previously ruled by the great devotee king Satyavadi. The banks of this lake were blessed by Shri Krishna and Arjuna. The guru then decided to hold a discourse of the Bhagavata. "
  },
  {
    "name": "pandharpur_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/35.gif",
    "gupt": false,
    "caption": " Giving the Lord and His consort a mat to sit on, he went off to finish his parent’s service and then taking their permission went back and respectfully bowed before the Lord who was so pleased with him that he offered him three boons of his choice. The lad requested that the Lord always remain in his home, to always speak His names, and to have His divine sight of the Braja land. The Lord agreed and explained, “I will appear as pandurano Vitthalnathji and those people who will come to my temple here, regardless of how sinful they are will have their impurities removed. You will have the sight of the Braja land when Shri Mahaprabhu Vallabhacharya arrives here. When Shri Mahaprabhu Vallabhacharya arrived there many years later on his all India pilgrimage he went to Lord Vitthalnathji’s temple and offered seven golden coins which were made into anklets. The he took the I ad pundarik and seven other Vaishnavas into a deep for our and their after resting under a large shady pepul tree he sprinkled some water over everyone, and they all had the sight of Krishn’s eternal Braja land. When the lad ask why he was blessed with that vision, Shri Mahaprabhuji told him, “Because you serve Lord Vitthalnathji.” "
  },
  {
    "name": "tapovan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/36.gif",
    "gupt": false,
    "caption": " Followers of the Mayavada came to discuss the meaning of the scripture with Shri Mahaprabhu Vallabhacharya and within one hour revealed to them the import of the Vedas and they requested to be initiated. After bathing in the Ganges, Shri Mahaprabhuji gave them the sacred tulsi necklace and Krishna mantra. From here, he proceeded south. "
  },
  {
    "name": "pannanri_baithkaji",
    "url": "https://www.nathdwara.in/center",
    "gupt": false,
    "caption": " Once while Mahaprabhuji was seated under a tree, Lord Nirsingh appear before him. Mahaprabhu Vallabhacharya stood up and payed his respect t him and said, “why have yo troubled yourself to come heri. I was about to go and see you”  “Is that true friendship? You must take all.” Shri Mahaprabhuji insisted. The Lord consented ;and gave ;the guru a little of what was left. After returning to the camp. Shri Mahaprabhu Vallabhacharya spoke the Shrimad Bhagavatam and Lord Nirsing came daily to listen. There, countless souls steeped in Ignorance were uplifted by the dust of Shri Mahaprabhu Vallabhacharya’s lotus feet. "
  },
  {
    "name": "siddhpur_baithkji",
    "url": "https://www.nathdwara.in/bethakji/72.gif",
    "gupt": false,
    "caption": " At Siddhapur, Shri Mahaprabhu Vallabhacharya halted by the side of the Bindu lake and related to Damala, :Here the great sage kardama had his hermitage and also here is the spot where Lord Kapildeva taught his mother Devatuti the Sandhya Yoga system. Devahuti then took on the form of this Bindu lake.” "
  },
  {
    "name": "nandgam_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/19.gif",
    "gupt": false,
    "caption": " The Muslim, who also witnessed it approached Mahaprabhuji and prayed to be made His disciples but was told that his liberation would take place in his next birth. The Muslim left, placing Mahaprabhu Vallabhachrya’s lotus feet always in his heart and shortly thereafter left his material body. He took rebirth as Sangji in the home of a shoe maker. He always practied tantra and became very proficient in the use of spells and mantras. Once he had a argument with one disciple of Shri Vitthalnathji, Shri Vallabhacharya’s son and decided that at night he would dispose of him by means of his various mantras and spells. For the whole night he tried but that devotee remained completely unaffected. Sangji then realized that he was a great saint and sought his surrender on the following day. The Vaishnava told him to leave the use of all such mantras and spells and to take the shelter of his guru Shri Vitthalnathji and the supreme Lord, Shri Krishna. Some days later, Shri Vitthalnathji stopped at Nandaguam on his way to Dwarka. That Vaishnava asked him on behalf of Sangji if he could be made a disciple. Shri Vitthalnthji replied, “That is the reason why I have come her.” Sangji then took initiation and became an accomiplished bhakta. "
  },
  {
    "name": "sanketvan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/18.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "kokilavan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/20.gif",
    "gupt": false,
    "caption": " Gokulnathji knowing the promise of Mahaprabhu Vallabhacharya made Chaturnaga his disciple. From that time, Chaturnaga always went about sing the glories of his guru. At the age of 150 he dropped his body at Govinda lake by the Govaradhan hill and enter into Krishna’s lila. "
  },
  {
    "name": "mansiganga_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/10.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "mandrachal_baithkji",
    "url": "https://www.nathdwara.in/bethakji/82.gif",
    "gupt": true,
    "caption": ""
  },
  {
    "name": "godhara_baithkji",
    "url": "https://www.nathdwara.in/bethakji/70.gif",
    "gupt": false,
    "caption": " At godhra, Shri Mahaprabhu Vallabhacharya stayed at the home of Ranavyasa. Before he took initiation, he was a great scholar of vedic literature and was very proud of his extensive learning. Once, when he was defeated in Benares, he became so depressed that he decided to drown himself in the Ganges river. At that time, Shri Mahaprabhuji was performing his prayers on the nearby banks and Krishnadas Meghan asked the guru what was the fruit received from drowning oneself in the Ganges river. Shri Mahaprabhuj explained, “That soul would undergo at least seven hellish lives and would gain no fruits here or elsewhere.” "
  },
  {
    "name": "surat_baithkji",
    "url": "https://www.nathdwara.in/bethakji/53.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "gheravan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/17.gif",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed by a lake and held a ‘Bhagavata saptah’. One day he went on a walk to see the Gahavarvan forest and saw a dead boa constrictor with many ants biting it saying, “why did you ruin our lives|”  After bathing in piri and Prem lake Shri Mahaprabhu Vallabhacharya and his disciples proceeded towards Sanket. "
  },
  {
    "name": "vrindavan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/04.gif",
    "gupt": false,
    "caption": " Once, a disciple of Shri Krishna Chaitanya, Gopaldas, prayed to Shri Krishna Chaitanya to give him a Deity to worship. Shri Chaitanya in turn entrusted to him a shaligram. Gopaldas worshipped the shligram but was distressed at heart because he desired a Deity which he could decorate with clothes and jewels, and on a shligram this can not be done. He later approached hiis guru in hopes of securing such a Deity. Shri Krishna Chaitanya, however, remained silent. After Shri Chaitanaya and proceeded to Jagannathpuri, Gopaldas had a dream in which Shri Krishna Chaitanaya told him, “I have appeared to establish the greatness of chanting the Lord’s najes. Only Shri Vallabhacharya Mahaprabhu has the right to give the service of the Lord’s svarupa. By His grace your wish will become fulfilled.” "
  },
  {
    "name": "pindtarak_baithakji",
    "url": "https://www.nathdwara.in/385",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed under a large tree where he mentioned to his disciple Damala “when Krishna was king of Dwarka, he visited all these nearby holy places. This is where the sage’s Dhurvasa’s hermitage was.” Later, the religious guide of the area approached Shri Mahaprabhu and seeing his spiritual splendor requested initiation. Shri Mahaprabhuji advised. “This holy area will liberated you.” After giving him a generous gift, Shri Mahaprabhu Vallabhacharya headed onwards. "
  },
  {
    "name": "laxmibala_baithkaji",
    "url": "https://www.nathdwara.in/center",
    "gupt": false,
    "caption": "After performing his father’s last rites, he told his mother to proceed with his brother to his uncle’s house at Vidhyanagar while he stayed for 15 days under a tree near the temple. There he gave a seven day discourse on the Shrimad Bhagavatam and Lord Lakshman Balaji came to participate. After the discourse was completed Shri Mahaprabhuji went to the temple and made the Lord a food offering and perform His divine worship. The Lord appeared to Shri Vallabhacharya three other times, but these meeting have not been recorded. "
  },
  {
    "name": "gokul_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/01.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "radhkrishna_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/09.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "badibaithakgokul_baithkji",
    "url": "https://www.nathdwara.in/bethakji/02.gif",
    "gupt": false,
    "caption": " Shri Mahaprabhuji’s second seat at Gokul, is the largest of the three and it was there Shri Mahaprabhuji used to take His meals and give divine discourses. Once the disciples of the renowned Shri Krishna Chaitanya felt that they had the right to serve Shri Nathji, but Shri Nathji Himself advised them that their qualification was to worship Him by chanting His divine names, for through that worship; their liberation would occur. The Lord further explained that the right to His personal Services lay only in the hands of Shri Mahaprabhu Vallabhacharya "
  },
  {
    "name": "bhandarvan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/21.gif",
    "gupt": false,
    "caption": " From Kolilavan, Mahaprabhu Vallabhachayra proceeded to Bathain, Kotvan, and stayed the night at Shesasia. Then he continued to Ramghat, Gopighat, Gangavan, Nivarnvan, Chinghat, Nandaghat and then finally to Bhandirvan where he held a seven reading of the Shrimad Bhagavatam. Their Byastirth a religious head of the Madhava Sampradaya said to Mahaprabhu Vallabhcharys, “I have over 100,00 disciple and many famous kings are among them. Madavendra puri is my disciple and his disciple is Krishna Chaitanya. I have come here to drop my body. I feel that you are capable to take over my position, so I am giving you 100,00 rupees and my religious position. Shri Mahaprabhuji told him that he would reply him the next morning. That might, the servants of the Lord came and beat Vyastirth who cried, “why are you beating me? “The Lord’s servants replied, “you have the pride to think that you can give something to Mahaprabhu Vallabhacharya. Your words to his were most unbefitting. If you wish to fare well, go and grasp hi feet, seek his protection. "
  },
  {
    "name": "harikund_baithkji",
    "url": "https://www.nathdwara.in/bethakji/60.gif",
    "gupt": false,
    "caption": " At Dwarka, Shri Mahaprabhu Vallabhacharya stayed by the bands of the Gomati river. There, Lord Dwarkanathji came to met Shri Mahaprabhu and requested him to pass the four months of the rainy season there. Lord Dwarkanathji told the head priest of His temple Govindadas about Shri Mahaprabhuji’s divinity and that he could achieve true devotion through his grace. Govindadas then brought Shri Mahaprabhuji to the temple where the guru made the Lord’s divine services. "
  },
  {
    "name": "kurukshetra_baithkji",
    "url": "https://www.nathdwara.in/bethakji/75.gif",
    "gupt": false,
    "caption": " By the Kurushetra lake, Shri Mahaprabhu Vallabhacharya made his seat and told Krishnadas Meghan that, “It was here that the great Mahabharat war took place and it is also the place where Lord Krishna taught Arjuna the Bhagavat Gita.” "
  },
  {
    "name": "gopitalyaa_baithkji",
    "url": "https://www.nathdwara.in/bethakji/61.gif",
    "gupt": false,
    "caption": " Here, at Gopi Talaiya under a shady tree, Shri Mahaprabhu Vallabhacharya halted. Krishnadas Meghan asked Shri Mahaprabhuji why Gopi Talaiya was there when the Gopis always lived in Braja and not near Dwarka at Gopi Talaiya. The guru explainec, “Once while Shri Krishna resided in Dwarka he praised the Gopis of Braja in front of his Dwarka Queen Rukmuni. The Queen then said that she was his completely faithful wife but the Lord mentioned, “No doubt your devotion to me is great, but the Gopis of Braja broke all their worldly ties and religious codes for My sake. They came to me in the middle of the night. I don’t think even you, my wedded wife would leave everything and come to me in the forest at midnight on the mere calling of my flute.’ Rukmuni confidently replied that she certainly would. "
  },
  {
    "name": "malyachal_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/42.gif",
    "gupt": true,
    "caption": " Here in a sandalwood forest under a sandalwood tree Shri Mahaprabhu Vallabhacharya halted and Lord Henmagapal appear to the guru and said, “you have come to an area inhabitated by ferocious animals who are always fighting amongst each other. Although I live in the midst of a sandalwood forest, I always feel very hot, but by your mere sight, Ii have become cooled. You have appeared, although timeless to establish the path of Grace and wander about sanctifying the earth.”  Later, Shri Mahaprabhu Visited Lord Henmagopal’s temple and offered the Llord sandal paste, bananas and coconuts. After that the Lord would daily visit Shri Mahaprabhuji. On the last day of the discourse, Indara, the god of rain went to Lord Henmagapal’s temple and not find Him there waited for His return. When He did finally return, Indra questioned where He had been. The Lord replied, “I have been to hear Shri Mahaprabhu Vallabhacharya’s discourse. He is an incarnation of Krishna, It is he who held up the Govardhan mountain to protect the people of Braja from your rains. He is the Lord’s complete love-form appearing for the upliftment of divine souls. All the god’s witnessed his appearance at Charanath.” "
  },
  {
    "name": "sethbandh_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/41.gif",
    "gupt": false,
    "caption": " Here Shri Mahaprabhu Vallabhacharya explained to Krishnadas Meghan that Shri Ram crossed by bridge over the sea to Shri Lanka t rescue Shri Sita from the demon Ravana. Here Lord Rameshvaram come to visit Shri Mahaprabhuji Here by the dust of Shri Mahaprabhu Vallabhacharya’s lotus feet, many souls abecame qualified to make the Llord’s worship. "
  },
  {
    "name": "mulgomati_baithkji",
    "url": "https://www.nathdwara.in/bethakji/59.gif",
    "gupt": false,
    "caption": " Here, when Shri Mahaprabhu Vallabhacharya took his seat under a shady tree Krishnadas Meghan asked how the Mulgomati river came to be. Shri Mahaprabhuji enlightened, “Mulgomati descended form the eternal realm and was born as a princess. When she was young she told her father that she would arrange for her own marriage. Lord Dwarkanathji appeared and told her to take on the form of the a river and then she would be able to merge with the Lord in his form as an ocean. Taking her Lord’s advice she became the Gomati river which meets the ocean near Lord Darkanathji’s temple in Dwarka.” "
  },
  {
    "name": "shrirang_baithkaji",
    "url": "https://www.nathdwara.in/center",
    "gupt": false,
    "caption": " At Shri Rangji under a tree by the banks of the Kaveri river Shri Mahaprabhu Vallabhacharya stayed. There, Lord Rangji came from His eternal abode to see Shri Mahaprabhuji. And asked the guru about the divine appearance of Shri Nathji atop the Govardhan hill. Shri Mahaprabhuji later went to Lord Rangji’s temple where the head priest upon seeing Shri Mahaprabhuji had a vision and later took initiation form the guru.  During Shri Mahaprabhu Vallabhacharya’s seven day reading of the Shrimad Bhagavatam, many followers of the Mayavada arrived there and impressed with his teaching became his followers. "
  },
  {
    "name": "mansarovar_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/22.gif",
    "gupt": false,
    "caption": " From here Shri Mahaprabhuji went to Mathura and gave one Brahmin priest 100 rupees in honor of the completion of his first all India pilgrimage. Maheprabhu Vallabhacharya made three pilgrimages around the Braja land as well as three all India pilgrimages sanctifying everyplace he went. "
  },
  {
    "name": "parsoli_baithakji",
    "url": "https://www.nathdwara.in/bethakji/11.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "visnukanch_baithkaji",
    "url": "https://www.nathdwara.in/images/bg_cow.gif",
    "gupt": false,
    "caption": " At Vishnu Kanchi, Shri Mahaprabhu Vallabhacharya stayed by the banks of the Surbhi river. Here, Shri Mahaprabhuji mentioned, “In India, there are 7 puris, {spiritual centers} three and one half are Vishnu’s and the three and one half are Shiva’s Vishnu’s puris are Mathura, Ayodhya, Dwarka and Vishnu Kanch is the last half.”  Lord Varadraj Knowing Mahaprabhuji’s feelign had all the 26 stone steps removed and only then did the guru visit the temple. For two hours, Shir Mahaprabhu had intimate discussion with the Lord. Later he offered seven golden coins to the temple and special offerings wer prepared. The head priest there, realizing Shir Mahaprabhu Vallabhacharya’s divinity fell into a trance and when the guru awoke him the priest said, “I was having the divine sight of the Govardhan Hilll and the yamuna river, why did you awake me?” "
  },
  {
    "name": "sukaras_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/23.gif",
    "gupt": false,
    "caption": " In the area of Soram Kshetra at Soram Ghat, Shri Mahaprabhu Vallabhacharya made his halt. There Krishnadas Meghan went to see his former guru wiothout Mahaprabhuji’s permission. His previous guru asked him, “why have you made a second guru” Krishnadas replied, “ you are my guru and it is by your grace I have come into contact with Lord Vallabhacharya.” "
  },
  {
    "name": "pande_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/12.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "shankkhodwar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/62.gif",
    "gupt": false,
    "caption": "Shri Mahaprabhu Vallabhacharya halted here by the banks of the Shanka lake and mentioned to Damala, “It was her that the Lord killed the demon Shankasura ad took his conch. Lord Shanknarayan rules over this area to this day and because it is a beautiful place, Lord Dwarkanathji sports here. After Shri Mahaprabhuji made worship at Lord Shankanaryana’s temple, the Lord asked Shri Mahaprabhuji to speak on the Gopi’s “Song to a Flute” which appears in the tenth canto or the Shrimad Bhagavata. For three days and nights the guru explained just a single verse. The area became so saturated with bliss that no noticed the passing of time. After completing his Bhagavata discourse, Shri Mahaprabhuji proceeded to Narayana Sarovar. "
  },
  {
    "name": "tamrapar_baithakji",
    "url": "https://www.nathdwara.in/bethakji/44.gif",
    "gupt": true,
    "caption": " By the banks of the Tamraparni river, under a tree three miles form a large city, Shri Mahaprabhu Vallabhacharya stayed. The king of the nearby state was very ill and someone told him, “If you construct a gold statue of yourself and gift it to a Brahmin, the Brahmin will die and you will be cured.”  The distressed king then retired to the banks of the Tamraparni awaiting his death. There he saw Shri Mahaprabhu Vallabhacharya and said to him. “This land is doomed because the holy class is devoid of spirituality.” "
  },
  {
    "name": "loahgadh_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/43.gif",
    "gupt": false,
    "caption": " Shri Mahaprabhu Vallabhacharya stayed here under a tree by a large rock which had the impressions of an elephant’s footprint. Damala requested the guru, “This scenic place is full of souls who are ignorant by nature. If you speak the Bhagavata here, all these souls will be uplifted. Krishnadas Meghan then Said, “The only problem here is that there is no water.” "
  },
  {
    "name": "bahulvan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/08.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "pindtarak_baithakji",
    "url": "https://www.nathdwara.in/385",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed under a large tree where he mentioned to his disciple Damala “when Krishna was king of Dwarka, he visited all these nearby holy places. This is where the sage’s Dhurvasa’s hermitage was.” Later, the religious guide of the area approached Shri Mahaprabhu and seeing his spiritual splendor requested initiation. Shri Mahaprabhuji advised. “This holy area will liberated you.” After giving him a generous gift, Shri Mahaprabhu Vallabhacharya headed onwards. "
  },
  {
    "name": "laxmibala_baithkaji",
    "url": "https://www.nathdwara.in/center",
    "gupt": false,
    "caption": "After performing his father’s last rites, he told his mother to proceed with his brother to his uncle’s house at Vidhyanagar while he stayed for 15 days under a tree near the temple. There he gave a seven day discourse on the Shrimad Bhagavatam and Lord Lakshman Balaji came to participate. After the discourse was completed Shri Mahaprabhuji went to the temple and made the Lord a food offering and perform His divine worship. The Lord appeared to Shri Vallabhacharya three other times, but these meeting have not been recorded. "
  },
  {
    "name": "chitrakoot_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/24.gif",
    "gupt": false,
    "caption": " Here by the side of the Kantanath mountain under a shady tree Mahaprabhu Vallabhacharya conducted a discourse on the Shrimad Bhagavatam and Ramayan, the story of Lord Rama. Hunuman, the monkey god, standing daily came to hear the dscourse while standing on one foot. Shri Mahaprabhuji requested him to take his seat, but the monkey god replied that to stand was his oath of austerity.  Mahaprabhu Vallabhacharya later explained that the Kantanath mountain is the brother of Shri Giriraja Hill, therefore we should not walk on the sacred mountain. Kantanath mountain, wishing Mahaprabhuji to bless him with the touch of his feet, came disguised as a Brahman saying, “Sita and Ram have told me to tell you that they are on top of the Kantanath mnountain and are very hungry so please bring them some food.” "
  },
  {
    "name": "shayya_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/03.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "badibaithakgokul_baithkji",
    "url": "https://www.nathdwara.in/bethakji/02.gif",
    "gupt": false,
    "caption": " Shri Mahaprabhuji’s second seat at Gokul, is the largest of the three and it was there Shri Mahaprabhuji used to take His meals and give divine discourses. Once the disciples of the renowned Shri Krishna Chaitanya felt that they had the right to serve Shri Nathji, but Shri Nathji Himself advised them that their qualification was to worship Him by chanting His divine names, for through that worship; their liberation would occur. The Lord further explained that the right to His personal Services lay only in the hands of Shri Mahaprabhu Vallabhacharya "
  },
  {
    "name": "bhandarvan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/21.gif",
    "gupt": false,
    "caption": " From Kolilavan, Mahaprabhu Vallabhachayra proceeded to Bathain, Kotvan, and stayed the night at Shesasia. Then he continued to Ramghat, Gopighat, Gangavan, Nivarnvan, Chinghat, Nandaghat and then finally to Bhandirvan where he held a seven reading of the Shrimad Bhagavatam. Their Byastirth a religious head of the Madhava Sampradaya said to Mahaprabhu Vallabhcharys, “I have over 100,00 disciple and many famous kings are among them. Madavendra puri is my disciple and his disciple is Krishna Chaitanya. I have come here to drop my body. I feel that you are capable to take over my position, so I am giving you 100,00 rupees and my religious position. Shri Mahaprabhuji told him that he would reply him the next morning. That might, the servants of the Lord came and beat Vyastirth who cried, “why are you beating me? “The Lord’s servants replied, “you have the pride to think that you can give something to Mahaprabhu Vallabhacharya. Your words to his were most unbefitting. If you wish to fare well, go and grasp hi feet, seek his protection. "
  },
  {
    "name": "ayodhya_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/25.gif",
    "gupt": false,
    "caption": " Shri Mahaprabhuji then told Hanuman, “you should not listen to holy discourse in a nude state. “From that day Hanuman always wore some clothing. Later, Shri Mahabpabhuji met with Lord Rama and mentioned during their talks that Shri Rama was the Godheac governed by law. Hanuman hearing this doubted its validity. Ram, knowing of Hanuman’s doubt told him to bring Shri Mahaprabhuji some foodstuffs. When Hanuman present him the offereing he saw as Lord Ram. When he reported this amazing even t Shri Ram, the Lord said, “Shri Mahaprabhuji Vallabhacharya can take my form, but I cannot take his.” "
  },
  {
    "name": "haridwar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/76.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "prabhaskshetra_baithkji",
    "url": "https://www.nathdwara.in/bethakji/65.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "badrikashram_baithkji",
    "url": "https://www.nathdwara.in/bethakji/77.gif",
    "gupt": false,
    "caption": " On Lord Vaman’s appearance day, Shri Mahaprabhu Vallabhacharya arrived at Badrinath high in the Himilayas. He told Krishna Meghan to find some fruits as grains are not taken on that day. Lord Badrinath, taking on the form of a brahmin stoped Krishnadas and told him, “It is good to please the guru, but you will not find any fruits here.” "
  },
  {
    "name": "junagadh_baithkji",
    "url": "https://www.nathdwara.in/bethakji/64.gif",
    "gupt": false,
    "caption": " At Junagard by the banks of the Revati lake under a tree, Shri Mahaprabhu Vallabhacharya halted. After making came the Girnar and Revatachal mountains took on the forms of two young Brahmins boys and went to see Shri Mahaprabhuji and prayed, “you wander about purifying all of the holy places. Please bless these two mountains here by you touch.”  Shri Mahaprabhuji than sat on one the mountain’s stones which became as soft as butter. Shri Mahaprabhu Vallabhacharya’s footprint became embedded on the rock. "
  },
  {
    "name": "madhavpur_baithkji",
    "url": "https://www.nathdwara.in/bethakji/66.gif",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stopped by the side of the Kadam lake and mentioned to Damala, “It was here Lord Krishna and Rukmuni were married and in this lake they bathed. Afterwards, all the saints and hermits present at the ceremony also bathed.” "
  },
  {
    "name": "charnat_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/84.gif",
    "gupt": false,
    "caption": " At Charanat Shri Mahaprabhu Vallabhacharya stayed in a abower and conducted a saptah. Six miles away from where he was staying a Brahmin hermit who had daily recited the Vishunsahastranam, The Thousand Names of the Lord for the last twelve ;years. One day he found a Krishna Deity in the Ganges river and the Lord told him that because he was a hermit he would not be able to properly serve Him and but because the hermit offered the Lord ;milk, He agreed to stay with the Brahmin for one month. On the night before the birth of Shri Mahaprabhu Vallabhacharya’s second son, Shri Vitthalnath Gusianji, the Deity told the Brahmin to take Him to Shri Mahaprabhu Vallabhacharya explaining, “You will find him sitting by a lake. Explain to him that it is my wish that I remain there with him. Then I will be very pleased with you.”  Shri Mahaprabhu Vallabhacharya bathed and then gave gifts of jewels, chariots etc to all present. Shri Garga Acharya came to bless the child and predicted, This child will accomplish everything, he will have two wives and seven sons and his lineage will be made up of the Lord’s incarnation.s he will defeat the Mayavadians and uplift many divine souls. He will purify the world and accomplish more things than a thousand mouths can praise.”  After speaking those word, Garga Acharya left and all the other divine beings present there bowed and returned to their respective spheres. Shri Mahaprabhu Vallabhacharya gazing at his son knew he was the Lord Himself. A bhakta sang, splendor has spread in the four direction. "
  },
  {
    "name": "guptprayag_baithkji",
    "url": "https://www.nathdwara.in/bethakji/67.gif",
    "gupt": true,
    "caption": " On the banks of the Madhava Sarasvati river, Shri Mahaprabhu Vallabhacharya made his seat. After bathing in the river, Shri Mahaprabhuji had the sight of Lord Madhavaryji and stayed under a tree by the side of the Prayag lake where he told Damala that but at prayag, at the confluence of the Ganges, Yamuna lakes. The next morning Shri Mahaprabhuji began his seven days discourse on the Bhagavatam. Later, a Brahmin arrived and after bowing to Shri Mahaprabhuji revealed, “I have been meditating upon you for so long, now the fruit of my efforts has bloomed.” "
  },
  {
    "name": "vidyanagar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/49.gif",
    "gupt": true,
    "caption": " At vidhyanagar, Shri Mahaprabhu Vallabhacharya stayed by the Vidhya lake. It was here that Shri Mahaprabhu defeated the Mayavadians in a huge religious conference.  Once Shri Mahaprabhuji considered. “The king of Vidhyanagar is very religious man and it is in his kingdom that the four great Vaishnava lineages are being defeated in debate by the Mayavadians.” with those thoughts, young Vallabhacharya who was only eleven at that time proceed there. On his way, he passed through the town where Damodardas lived. Damodardas, father had recently passed away, and left his money to Damodardas and his three brother but Damodardas was unconcerned about such matters because his mind was absorbed in the thoughts of his future guru, Shri Mahaprabhuji. When Shri Mahaprabhu Vallabhacharya passed on the main street Damodardas, balcony, he immediately went to the street below and bow at the feet of his guru and took initiation.  The Lord then disappeared and Shri Mahaprabhuji awoke his disciples and silently left his uncle’s house. The next morning, Shri Mahaprabhuji order his Kamandal {a type of water pot made out of a type of pumpkin} t proceed to the conference hall and notify all of his arrival. His kamandal then flew into the great hall room and everyone present there stood up and the king told the kamandal to brign his master to the conference. Later, when Shri Mahaprabhu Vallabhacharya arrived there shinning like countless suns, King Krishnadeva Raya bowed at his feet. Within a very short time, Shri Mahaprabhuji defeated the Mayavadians with his teaching of Brahmavada, that everything is God and nothing but God. The king then present Mahaprabhuji with 600 I bs of gold and honored him with a sacred bath. Shri Mahaprabhuji distributed the gold to all the Brahmins and when he made the king his disciple he was offered a large tray of gold coins. Shri Mahaprabhuji took only seven of those coins and later offered them to Lord Jagannath. The head of the Madhva lineage then requested Shri Mahaprabhu to take over his religious seat, but Shri Mahaprabhuji considered that his appearance was to establish the Vishnu Svami who once told me, “The Lord’s service is our only interested in their own pleasure. The Lord does as he pleases, we can only follow His wishes’  “Once the Lord told Vishnu Svami that the Lord would appear as Shri Vallabhacharya and that he will establish the path of Devotion. Vishnu Svami told me when he left for the divine abode that I should stay and head the Vishnu Svami lineage till you come her and defeat the Mayavadians. For the past 750 years I have been thinking about you.” Shri Mahaprabhu Vallabhacharya then accepted the leadership of the Vishnu Svami lineage and Bilvamangal ascended to the eternal abode before the entire assembly. Shri Mahaprabhu Vallabhacharya stayed in Vidhya Nagar for a few days giving discourse at the royal palace before proceeding onwards. "
  },
  {
    "name": "padmanabhji_baithkji",
    "url": "https://www.nathdwara.in/bethakji/47.gif",
    "gupt": true,
    "caption": " At a lovely spot, Shri Mahaprabhu Vallabhacharya made his camp. Here Shri Mahaprabhuji told Damala, “From the navel of Shri Pdmanabhaji who lies resting on the serpent god, Braham the creator emerged on the stem of a lotus, “After saying that, Lord Padmanabhaji arrived and the guru greeted Him with folded hands "
  },
  {
    "name": "pampasarovar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/46.gif",
    "gupt": true,
    "caption": " By the pampa lake, under a tree, Shri Mahaprabhu Vallabhacharya halted. While the guru was preparing the offering he told Krishnadas to bring some leaves. When Krishnadas left, he saw a large terrible beast which resemble death, but unconcerned went about his business collecting leaves. Suddenly the beast called out ot Krishnadas, “Since the time of Lord Ram I have been sadly sitting here. Now that Shri Mahaprabhuji has arrived, I must pray to him for my liberation. The grace of the Lord’s devotees will enable me to attain my final release. Please request your guru to uplift me.” After speaking the Shrimad Bhagavata Srhi Mahaprabhu Vallabhacharya and his disciples moved onwards. "
  },
  {
    "name": "krishnasarovar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/45.gif",
    "gupt": true,
    "caption": " By the banks of the Tamraparni river, under a tree three miles form a large city, Shri Mahaprabhu Vallabhacharya stayed. The king of the nearby state was very ill and someone told him, “If you construct a gold statue of yourself and gift it to a Brahmin, the Brahmin will die and you will be cured.”  The distressed king then retired to the banks of the Tamraparni awaiting his death. There he saw Shri Mahaprabhu Vallabhacharya and said to him. “This land is doomed because the holy class is devoid of spirituality.” "
  },
  {
    "name": "narayansarovar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/63.gif",
    "gupt": false,
    "caption": " At the dite of the great sage Markandeya’s hermitage, by the banks of the Narayana lake. Shri Mahaprabhu Vallabhacharya mentioned to Damala, “This area has been blessed by the Lord’s presence, therefore, the Narayana lake manifest. After bathing in the lake the guru began his teaching and fLord Shvi came to listen. Lord Shiva had a devotee who would not take any food or water until he had Shiva’s sight. When Shiva returned very late to his temple he revealed that the reason why he was late was because he had been listening to Shri Mahaprabhuji’s Bhagavata. "
  },
  {
    "name": "sundeshila_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/14.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "hanumanghat_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/28.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "kamodvam_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/07.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "purshotam_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/27.gif",
    "gupt": false,
    "caption": " Here, Shri Mahaprabhu Vallabhacharya stayed at the house of Purushttamdas and celebrated Lord Krishna’s appearance day. During the festivities, Krishna’s parents and friends all appeared. Everyond present had this divine vision and Shiva joined in the celebrations. "
  },
  {
    "name": "govindkund_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/13.gif",
    "gupt": false,
    "caption": " At the Govinda lake, Shri Mahaprabhu Vallabhacharya passed theree days speaking about Shri Krishna’s lilas. Krishnadas Meghan prayed to the guru to have the divine vision of the realm within the Govardhan Hill, but Shri Mahaprabhujji remained silent to his request. "
  },
  {
    "name": "madhuvan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/06.gif",
    "gupt": false,
    "caption": " From here, Shri Mahaprabhu Vallabhacharya accompanied by Vasudeva Chhakra, Yadvendradas, Govindad Deba, Madhava Bhatt Surdas, and Pramanandas continued his pilgrimage of the Sacre Braja land. "
  },
  {
    "name": "shankkhodwar_baithkji",
    "url": "https://www.nathdwara.in/bethakji/62.gif",
    "gupt": false,
    "caption": "Shri Mahaprabhu Vallabhacharya halted here by the banks of the Shanka lake and mentioned to Damala, “It was her that the Lord killed the demon Shankasura ad took his conch. Lord Shanknarayan rules over this area to this day and because it is a beautiful place, Lord Dwarkanathji sports here. After Shri Mahaprabhuji made worship at Lord Shankanaryana’s temple, the Lord asked Shri Mahaprabhuji to speak on the Gopi’s “Song to a Flute” which appears in the tenth canto or the Shrimad Bhagavata. For three days and nights the guru explained just a single verse. The area became so saturated with bliss that no noticed the passing of time. After completing his Bhagavata discourse, Shri Mahaprabhuji proceeded to Narayana Sarovar. "
  },
  {
    "name": "tamrapar_baithakji",
    "url": "https://www.nathdwara.in/bethakji/44.gif",
    "gupt": true,
    "caption": " By the banks of the Tamraparni river, under a tree three miles form a large city, Shri Mahaprabhu Vallabhacharya stayed. The king of the nearby state was very ill and someone told him, “If you construct a gold statue of yourself and gift it to a Brahmin, the Brahmin will die and you will be cured.”  The distressed king then retired to the banks of the Tamraparni awaiting his death. There he saw Shri Mahaprabhu Vallabhacharya and said to him. “This land is doomed because the holy class is devoid of spirituality.” "
  },
  {
    "name": "loahgadh_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/43.gif",
    "gupt": false,
    "caption": " Shri Mahaprabhu Vallabhacharya stayed here under a tree by a large rock which had the impressions of an elephant’s footprint. Damala requested the guru, “This scenic place is full of souls who are ignorant by nature. If you speak the Bhagavata here, all these souls will be uplifted. Krishnadas Meghan then Said, “The only problem here is that there is no water.” "
  },
  {
    "name": "bahulvan_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/08.gif",
    "gupt": false,
    "caption": ""
  },
  {
    "name": "naimisharnya_baithakji",
    "url": "https://www.nathdwara.in/bethakji/26.gif",
    "gupt": false,
    "caption": "Here by the Gomati lake, under a tree, Shri Mahaprabhu Vallabhacharya spoke the Bhagavatam for seven days. Once while he was making his to their sacrifice. After beginning the sacred rite, they all sat down and offered worship to him and requested to know the true import of sacrifice. For nine hours Shri Mahabrabhuji unlightened then before returing to his lamp many other events happened here, but this was the main once. "
  },
  {
    "name": "janardankshetra_baithakji",
    "url": "https://www.nathdwara.in/bethakji/48.gif",
    "gupt": false,
    "caption": " By a beautiful lake, Shri Mahaprabhu Vallabhacharya halted. On the following day, joined by his disciples, they went to have the sight of Lord Janardan in the temple. After Shri Mahaprabhuji made the Lord’s ornamentation Lord Janardan said, “Today I have had the opportunity to experience the touch of your sacred hands.” "
  },
  {
    "name": "harihar_baithkaji",
    "url": "https://www.nathdwara.in/bethakji/29.gif",
    "gupt": false,
    "caption": " Where the Ganges river and Gallika rivers meet, resides Shri Mahaprabhu Vallabhacharya’s disciple Bhagavandas. Here, the guru eternally resides. After Shri Mahaprabhuji’s physical dissappearance for the world, all of his followers were deeply grieved. Some bhaktas went to the house of Bhagavandas to tell him the news. Bhagavandas immediately consoled them, “Our blessed teacher is still here.” When he opened the doors to his private temple, all the Vaishnavas had the sight of Shri Mahaprabhuji sitting there reading the Shrimad Bhgavatam. "
  }
]